In [1]:
import pandas as pd

In [2]:
dfalunos = pd.read_csv("16_dataset_notas_alunos.csv")
dfgrupos = pd.read_csv("17_notas_grupos.csv")

In [3]:
dfalunos

    Aluno  Idade  Matemática  Ciências
0       1     17          67        60
1       2     15          83        78
2       3     17          70        61
3       4     17          76        85
4       5     15          67        91
..    ...    ...         ...       ...
95     96     15          87        71
96     97     15          82        81
97     98     17          96        81
98     99     15          91        89
99    100     15          92        97

[100 rows x 4 columns]

In [4]:
dfgrupos

    Grupo_A  Grupo_B
0        51       23
1        92       25
2        14       88
3        71       59
4        60       40
..      ...      ...
95       39        0
96       84       26
97       79       61
98       81       76
99       52        2

[100 rows x 2 columns]

In [ ]:
# Calcule a média das notas em Matemática e Ciências

In [15]:
media = dfalunos[['Matemática', 'Ciências']].mean()
media

Matemática    81.57
Ciências      80.26
dtype: float64

In [12]:
# Determine a moda das notas em Matemática e Ciências.
mediana = dfalunos[['Matemática', 'Ciências']].median()
mediana

Matemática    84.5
Ciências      79.5
dtype: float64

In [ ]:
# Calcule a amplitude das notas em Matemática e Ciências.

In [23]:
amplitude = dfalunos['Matemática'].max() - dfalunos['Matemática'].min()
amplitude

np.int64(40)

In [24]:
amp = dfalunos['Ciências'].max() - dfalunos['Matemática'].min()
amp

np.int64(40)

In [18]:
# Calcule a variância das notas em Matemática e Ciências.
variancia = dfalunos[['Matemática', 'Ciências']].var()
variancia

Matemática    160.752626
Ciências      150.153939
dtype: float64

In [22]:
# Calcule o desvio padrão das notas em Matemática e Ciências.
variancia = dfalunos[['Matemática', 'Ciências']].std()
variancia

Matemática    12.678826
Ciências      12.253732
dtype: float64

In [25]:
# Calcule a covariância entre as notas de Matemática e Ciências 
covariancia = dfalunos[['Matemática', 'Ciências']].cov()
covariancia

            Matemática    Ciências
Matemática  160.752626    9.133131
Ciências      9.133131  150.153939

In [26]:
# Calcule a correlação entre as notas de Matemática e Ciências.
correlacao = dfalunos[['Matemática', 'Ciências']].corr()
correlacao

            Matemática  Ciências
Matemática    1.000000  0.058786
Ciências      0.058786  1.000000